/**********************************************************************
	File	integral.cpp
	Ver		1.0.0
	Date	1.0.0	2018/11/18
	Auther	Maegaki Noriyoshi
	note	積分器を双一次変換して離散化した．（台形公式と同じ）
**********************************************************************/

/**********************************************************************
 Includes
**********************************************************************/
#include "roblab/integral.h"
#include <math.h>

/**********************************************************************
 DIFERENTIAL型の変数を定義．時定数とサンプル周期(制御周期)を設定し，
 メンバ変数を初期化，サンプル周期から求まる係数を計算するコンストラクタ．
	引数1	サンプル周期
**********************************************************************/
Integral::Integral(float ctrl_period_sec) : ctrl_period_sec_(ctrl_period_sec){
	
	// 各メンバ変数を初期化
	output_ = 0.0f;
	input_prev_ = 0.0f;
	
	// 係数をあらかじめ計算
	coeff_ = ctrl_period_sec_ / 2.0f;
	
}

/**********************************************************************
 サンプル周期(制御周期)を設定し，
 メンバ変数を初期化，サンプル周期から求まる係数を計算する関数．
	引数1	サンプル周期
**********************************************************************/
void Integral::set(float ctrl_period_sec){
	
	ctrl_period_sec_ = ctrl_period_sec;
	
	// 各メンバ変数を初期化
	output_ = 0.0f;
	input_prev_ = 0.0f;
	
	// ２つの係数をあらかじめ計算
	coeff_ = ctrl_period_sec_ / 2.0f;
	
}

/**********************************************************************
 メンバ変数を初期化する関数．
**********************************************************************/
void Integral::reset(){
	
	// 各メンバ変数を初期化
	output_ = 0.0f;
	input_prev_ = 0.0f;
	
}

/**********************************************************************
 入力値に対して積分器に通す関数．
	引数1	このフィルタへの入力値
	返り値	このフィルタの出力値
**********************************************************************/
float Integral::filter(float input){
	
	output_ = output_ + coeff_ * (input + input_prev_);
	input_prev_ = input;
	
	return output_;
	
}

